Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
      <edc:SFRDef edc:_addr="0x40000008" edc:access="-------------------------nnnnnnn" edc:cname="HSMCI_DTOR" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DTOCYC" edc:desc="Data Timeout Cycle Number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DTOMUL" edc:desc="Data Timeout Multiplier" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_1" edc:desc="DTOCYC" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16" edc:desc="DTOCYC x 16" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="DTOCYC x 128" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_256" edc:desc="DTOCYC x 256" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_1024" edc:desc="DTOCYC x 1024" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_4096" edc:desc="DTOCYC x 4096" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_65536" edc:desc="DTOCYC x 65536" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1048576" edc:desc="DTOCYC x 1048576" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000000C" edc:access="------------------------nn----nn" edc:cname="HSMCI_SDCR" edc:impl="0xC3" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="SDCSEL" edc:desc="SDCard/SDIO Slot" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SLOTA" edc:desc="Slot A is selected." edc:when="(field &amp; 0x3) == 0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SDCBUS" edc:desc="SDCard/SDIO Bus Width" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1" edc:desc="1 bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_4" edc:desc="4 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8" edc:desc="8 bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_ARGR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="ARG" edc:desc="Command Argument" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000014" edc:access="----wwww--wwwwww---wwwwwwwwwwwww" edc:cname="HSMCI_CMDR" edc:impl="0xF3F1FFF" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CMDNB" edc:desc="Command Number" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="RSPTYP" edc:desc="Response Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORESP" edc:desc="No response" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_48_BIT" edc:desc="48-bit response" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_136_BIT" edc:desc="136-bit response" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="R1B" edc:desc="R1b response type" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPCMD" edc:desc="Special Command" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="STD" edc:desc="Not a special CMD." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INIT" edc:desc="Initialization CMD: 74 clock cycles for initialization sequence." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CE_ATA" edc:desc="CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IT_CMD" edc:desc="Interrupt command: Corresponds to the Interrupt Mode (CMD40)." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="IT_RESP" edc:desc="Interrupt response: Corresponds to the Interrupt Mode (CMD40)." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BOR" edc:desc="Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly." edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="EBO" edc:desc="End Boot Operation. This command allows the host processor to terminate the boot operation mode." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPDCMD" edc:desc="Open Drain Command" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PUSHPULL" edc:desc="Push pull command." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OPENDRAIN" edc:desc="Open drain command." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXLAT" edc:desc="Max Latency for Command to Response" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="_5" edc:desc="5-cycle max latency." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="64-cycle max latency." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRCMD" edc:desc="Transfer Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DATA" edc:desc="No data transfer" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="START_DATA" edc:desc="Start data transfer" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="STOP_DATA" edc:desc="Stop data transfer" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRDIR" edc:desc="Transfer Direction" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="WRITE" edc:desc="Write." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="READ" edc:desc="Read." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRTYP" edc:desc="Transfer Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="MMC/SD Card Single Block" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="MMC/SD Card Multiple Block" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="STREAM" edc:desc="MMC Stream" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="SDIO Byte" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="BLOCK" edc:desc="SDIO Block" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="IOSPCMD" edc:desc="SDIO Special Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="STD" edc:desc="Not an SDIO Special Command" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="SDIO Suspend Command" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="SDIO Resume Command" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ATACS" edc:desc="ATA with Command Completion Signal" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal operation mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="COMPLETION" edc:desc="This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BOOT_ACK" edc:desc="Boot Operation Acknowledge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000018" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_BLKR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="BCNT" edc:desc="MMC/SDIO Block Count - SDIO Byte Count" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="BLKLEN" edc:desc="Data Block Length" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000001C" edc:access="-------------------------nnnnnnn" edc:cname="HSMCI_CSTOR" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CSTOCYC" edc:desc="Completion Signal Timeout Cycle Number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CSTOMUL" edc:desc="Completion Signal Timeout Multiplier" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_1" edc:desc="CSTOCYC x 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16" edc:desc="CSTOCYC x 16" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="CSTOCYC x 128" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_256" edc:desc="CSTOCYC x 256" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_1024" edc:desc="CSTOCYC x 1024" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_4096" edc:desc="CSTOCYC x 4096" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_65536" edc:desc="CSTOCYC x 65536" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1048576" edc:desc="CSTOCYC x 1048576" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000020" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="HSMCI_RSPR0" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:desc="Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000024" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="HSMCI_RSPR1" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:desc="Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000028" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="HSMCI_RSPR2" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:desc="Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000002C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="HSMCI_RSPR3" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:desc="Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
