Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
      <edc:SFRDef edc:_addr="0x4000044C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO147" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000450" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO148" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000454" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO149" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000458" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO150" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000045C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO151" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000460" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO152" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000464" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO153" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000468" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO154" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000046C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO155" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000470" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO156" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000474" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO157" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000478" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO158" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000047C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO159" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000480" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO160" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000484" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO161" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
