Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
      <edc:AdjustPoint edc:_addr="0x40020280" edc:offset="0x180"/>
      <edc:SFRDef edc:_addr="0x40020400" edc:access="------------------w---w---------" edc:cname="PWM0_CMUPD0" edc:impl="0x2200" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:desc="Channel Polarity Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:desc="Channel Polarity Inversion Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40020404" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x40020420" edc:access="------------------w---w---------" edc:cname="PWM0_CMUPD1" edc:impl="0x2200" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:desc="Channel Polarity Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:desc="Channel Polarity Inversion Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40020424" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4002042C" edc:access="nnnn--nnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM0_ETRG1" edc:impl="0xF3FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="MAXCNT" edc:desc="Maximum Counter value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="TRGMODE" edc:desc="External Trigger Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="External trigger is not enabled." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="External PWM Reset Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="External PWM Start Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Cycle-by-cycle Duty Mode" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGEDGE" edc:desc="Edge Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FALLING_ZERO" edc:desc="TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_ONE" edc:desc="TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGFILT" edc:desc="Filtered input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSRC" edc:desc="Trigger Source" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFEN" edc:desc="Recoverable Fault Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020430" edc:access="------------nnnn---------nnnnnnn" edc:cname="PWM0_LEBR1" edc:impl="0xF007F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="LEBDELAY" edc:desc="Leading-Edge Blanking Delay for TRGINx" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PWMLFEN" edc:desc="PWML Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLREN" edc:desc="PWML Rising Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHFEN" edc:desc="PWMH Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHREN" edc:desc="PWMH Rising Edge Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40020434" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40020440" edc:access="------------------w---w---------" edc:cname="PWM0_CMUPD2" edc:impl="0x2200" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:desc="Channel Polarity Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:desc="Channel Polarity Inversion Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40020444" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4002044C" edc:access="nnnn--nnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM0_ETRG2" edc:impl="0xF3FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="MAXCNT" edc:desc="Maximum Counter value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="TRGMODE" edc:desc="External Trigger Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="External trigger is not enabled." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="External PWM Reset Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="External PWM Start Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Cycle-by-cycle Duty Mode" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGEDGE" edc:desc="Edge Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FALLING_ZERO" edc:desc="TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_ONE" edc:desc="TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGFILT" edc:desc="Filtered input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSRC" edc:desc="Trigger Source" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFEN" edc:desc="Recoverable Fault Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020450" edc:access="------------nnnn---------nnnnnnn" edc:cname="PWM0_LEBR2" edc:impl="0xF007F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="LEBDELAY" edc:desc="Leading-Edge Blanking Delay for TRGINx" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PWMLFEN" edc:desc="PWML Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLREN" edc:desc="PWML Rising Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHFEN" edc:desc="PWMH Falling Edge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMHREN" edc:desc="PWMH Rising Edge Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
