Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
      <edc:SFRDef edc:_addr="0x40038684" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR1" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038688" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR2" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003868C" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR3" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038690" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR4" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038694" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR5" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038698" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR6" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003869C" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR7" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
