Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
      <edc:SFRDef edc:_addr="0x400540C8" edc:access="-----------------------------www" edc:cname="TC3_QIER" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540CC" edc:access="-----------------------------www" edc:cname="TC3_QIDR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540D0" edc:access="-----------------------------rrr" edc:cname="TC3_QIMR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540D4" edc:access="-----------------------r-----rrr" edc:cname="TC3_QISR" edc:impl="0x107" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540D8" edc:access="------------------------------nn" edc:cname="TC3_FMR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="ENCF0" edc:desc="Enable Compare Fault Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENCF1" edc:desc="Enable Compare Fault Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400540DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400540E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TC3_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400540E8" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400540FC" edc:access="-------------rrr----rrrrrrrrrrrr" edc:cname="TC3_VER" edc:impl="0x70FFF" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="Version of the Hardware Module" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MFN" edc:desc="Metal Fix Number" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40054100" edc:offset="0x3F00"/>
      <edc:SFRDef edc:_addr="0x40058000" edc:access="ww-----w------ww---w----w-----ww" edc:cname="SPI1_CR" edc:impl="0xC1031083" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="SPIEN" edc:desc="SPI Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIDIS" edc:desc="SPI Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="SPI Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:desc="Request to Clear the Comparison Trigger" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXFCLR" edc:desc="Transmit FIFO Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFCLR" edc:desc="Receive FIFO Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:desc="Last Transfer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:desc="FIFO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFODIS" edc:desc="FIFO Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40058004" edc:access="nnnnnnnn----nnnn--------n-nn-nnn" edc:cname="SPI1_MR" edc:impl="0xFF0F00B7" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="MSTR" edc:desc="Master/Slave Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PS" edc:desc="Peripheral Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCSDEC" edc:desc="Chip Select Decode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MODFDIS" edc:desc="Mode Fault Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:desc="Wait Data Read Before Transfer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LLB" edc:desc="Local Loopback Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:desc="Peripheral Chip Select" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCS" edc:desc="Delay Between Chip Selects" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40058008" edc:access="------------rrrrrrrrrrrrrrrrrrrr" edc:cname="SPI1_RDR" edc:impl="0xFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="RD" edc:desc="Receive Data" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:desc="Peripheral Chip Select" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005800C" edc:access="-------w----wwwwwwwwwwwwwwwwwwww" edc:cname="SPI1_TDR" edc:impl="0x10FFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="TD" edc:desc="Transmit Data" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:desc="Peripheral Chip Select" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:desc="Last Transfer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40058010" edc:access="---------------r-----rrr----rrrr" edc:cname="SPI1_SR" edc:impl="0x1070F" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full (cleared by reading SPI_RDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="Transmit Data Register Empty (cleared by writing SPI_TDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:desc="Mode Fault Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:desc="NSS Rising (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty (cleared by writing SPI_TDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:desc="Underrun Error Status (Slave mode only) (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SPIENS" edc:desc="SPI Enable Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40058014" edc:access="---------------------www----wwww" edc:cname="SPI1_IER" edc:impl="0x70F" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="SPI Transmit Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:desc="Mode Fault Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:desc="NSS Rising Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:desc="Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40058018" edc:access="---------------------www----wwww" edc:cname="SPI1_IDR" edc:impl="0x70F" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="SPI Transmit Data Register Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:desc="Mode Fault Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:desc="NSS Rising Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:desc="Underrun Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005801C" edc:access="---------------------rrr----rrrr" edc:cname="SPI1_IMR" edc:impl="0x70F" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="SPI Transmit Data Register Empty Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:desc="Mode Fault Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:desc="NSS Rising Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:desc="Underrun Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40058020" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40058030" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI1_CSR0" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:desc="Chip Select Active After Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:desc="Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:desc="Serial Clock Bit Rate" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:desc="Delay Before SPCK" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40058034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI1_CSR1" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:desc="Chip Select Active After Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:desc="Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:desc="Serial Clock Bit Rate" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:desc="Delay Before SPCK" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40058038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI1_CSR2" edc:nzwidth="0x20" ltx:memberofperipheral="SPI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI1">
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:desc="Chip Select Active After Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:desc="Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:desc="Serial Clock Bit Rate" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:desc="Delay Before SPCK" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
