Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
      <edc:AdjustPoint edc:_addr="0x4007C024" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4007C030" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QSPI_IAR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C034" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="QSPI_ICR" edc:impl="0xFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="INST" edc:desc="Instruction Code" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="OPT" edc:desc="Option Code" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C038" edc:access="-----------nnnnn-nnn-nnnnnnn-nnn" edc:cname="QSPI_IFR" edc:impl="0x1F77F7" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="WIDTH" edc:desc="Width of Instruction Code, Address, Option Code and Data" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SINGLE_BIT_SPI" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_OUTPUT" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_OUTPUT" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_IO" edc:desc="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_IO" edc:desc="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_CMD" edc:desc="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_CMD" edc:desc="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INSTEN" edc:desc="Instruction Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDREN" edc:desc="Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPTEN" edc:desc="Option Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAEN" edc:desc="Data Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPTL" edc:desc="Option Code Length" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OPTION_1BIT" edc:desc="The option code is 1 bit long." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OPTION_2BIT" edc:desc="The option code is 2 bits long." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OPTION_4BIT" edc:desc="The option code is 4 bits long." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OPTION_8BIT" edc:desc="The option code is 8 bits long." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADDRL" edc:desc="Address Length" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="_24_BIT" edc:desc="The address is 24 bits long." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_32_BIT" edc:desc="The address is 32 bits long." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TFRTYP" edc:desc="Data Transfer Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TRSFR_READ" edc:desc="Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial Flash memory is not possible." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRSFR_READ_MEMORY" edc:desc="Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial Flash memory is possible." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRSFR_WRITE" edc:desc="Write transfer into the serial memory.Scrambling is not performed." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRSFR_WRITE_MEMORY" edc:desc="Write data transfer into the serial memory.If enabled, scrambling is performed." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRM" edc:desc="Continuous Read Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The Continuous Read mode is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The Continuous Read mode is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBDUM" edc:desc="Number Of Dummy Cycles" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4007C03C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4007C040" edc:access="------------------------------nn" edc:cname="QSPI_SMR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="SCREN" edc:desc="Scrambling/Unscrambling Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The scrambling/unscrambling is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The scrambling/unscrambling is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RVDIS" edc:desc="Scrambling/Unscrambling Random Value Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
