Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
      <edc:SFRDef edc:_addr="0xE000EF38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:cname="FPCAR" edc:impl="0xFFFFFFF8" edc:nzwidth="0x20" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="The location of the unpopulated floating-point register space allocated on an exception stack frame." edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF3C" edc:access="-----nnnnn----------------------" edc:cname="FPDSCR" edc:impl="0x7C00000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="RMode" edc:desc="Default value for FPSCR.RMode." edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FZ" edc:desc="Default value for FPSCR.FZ." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DN" edc:desc="Default value for FPSCR.DN." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHP" edc:desc="Default value for FPSCR.AHP." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF40" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MVFR0" edc:mclr="00010000000100010000000000100001" edc:nzwidth="0x20" edc:por="00010000000100010000000000100001" ltx:memberofperipheral="SCB FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="A_SIMD_registers" edc:desc="Indicates the size of the FP register bank" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Single_precision" edc:desc="Indicates the hardware support for FP single-precision operations" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Double_precision" edc:desc="Indicates the hardware support for FP double-precision operations" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FP_excep_trapping" edc:desc="Indicates whether the FP hardware implementation supports exception trapping" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Divide" edc:desc="Indicates the hardware support for FP divide operations" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Square_root" edc:desc="Indicates the hardware support for FP square root operations" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Short_vectors" edc:desc="Indicates the hardware support for FP short vectors" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FP_rounding_modes" edc:desc="Indicates the rounding modes supported by the FP floating-point hardware" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF44" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MVFR1" edc:mclr="00010001000100010000000000110001" edc:nzwidth="0x20" edc:por="00010001000100010000000000110001" ltx:memberofperipheral="SCB FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="FtZ_mode" edc:desc="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="D_NaN_mode" edc:desc="Indicates whether the FP hardware implementation supports only the Default NaN mode" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="FP_HPFP" edc:desc="Floating Point Half-Precision and double-precision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FP_fused_MAC" edc:desc="Indicates whether the FP supports fused multiply accumulate operations" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF48" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MVFR2" edc:mclr="00010000000100010000000001100001" edc:nzwidth="0x20" edc:por="00010000000100010000000001100001" ltx:memberofperipheral="SCB FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="VFP_Misc" edc:desc="Indicates the hardware support for FP miscellaneous features" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SQIDataSector edc:beginaddr="0x80000000" edc:endaddr="0xA0000000" edc:isexecutable="true" edc:regionid="QSPIMEM"/>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x200000" edc:regionid="ITCM"/>
    <edc:CodeSector atdf:pagesize="0x200" edc:beginaddr="0x400000" edc:endaddr="0x480000" edc:regionid="IFLASH"/>
    <edc:BootConfigSector edc:beginaddr="0x800000" edc:endaddr="0x804000" edc:regionid="IROM"/>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20020000" edc:isexecutable="true" edc:regionid="DTCM"/>
    <edc:GPRDataSector edc:beginaddr="0x20400000" edc:endaddr="0x20440000" edc:isexecutable="true" edc:regionid="IRAM"/>
    <edc:EBIDataSector edc:beginaddr="0x60000000" edc:endaddr="0x61000000" edc:isexecutable="true" edc:regionid="EBI_CS0"/>
    <edc:EBIDataSector edc:beginaddr="0x61000000" edc:endaddr="0x62000000" edc:isexecutable="true" edc:regionid="EBI_CS1"/>
    <edc:EBIDataSector edc:beginaddr="0x62000000" edc:endaddr="0x63000000" edc:isexecutable="true" edc:regionid="EBI_CS2"/>
    <edc:EBIDataSector edc:beginaddr="0x63000000" edc:endaddr="0x64000000" edc:isexecutable="true" edc:regionid="EBI_CS3"/>
    <edc:DDRSector edc:beginaddr="0x70000000" edc:endaddr="0x80000000" edc:isexecutable="true" edc:regionid="SDRAM_CS"/>
    <edc:DeviceIDSector edc:beginaddr="0x400E0940" edc:endaddr="0x400E0944" edc:mask="0xFFFFFFE0" edc:regionid="devid" edc:value="0xA12D0A00"/>
    <edc:EmulatorSector edc:beginaddr="0xE0001000" edc:endaddr="0xE000F000" edc:regionid="emulation"/>
  </edc:PhysicalSpace>
  <edc:FusesSpace edc:magicoffset="0xD0000000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="-------nn-----nn" edc:cname="GPNVMBITS" edc:factorydefault="0x0" edc:impl="0x183" edc:nzwidth="0x10" edc:unused="0x0" edc:useinchecksum="0xFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="SECURITY_BIT" edc:desc="Security Bit" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOOT_MODE" edc:desc="Boot Mode Selection" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:DCRFieldDef edc:cname="TCM_CONFIGURATION" edc:desc="TCM Configuration" edc:nzwidth="0x2"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0xD0000004">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_0" edc:desc="Lock Region 0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_1" edc:desc="Lock Region 1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_2" edc:desc="Lock Region 2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_3" edc:desc="Lock Region 3" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_4" edc:desc="Lock Region 4" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_5" edc:desc="Lock Region 5" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_6" edc:desc="Lock Region 6" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_7" edc:desc="Lock Region 7" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_8" edc:desc="Lock Region 8" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_9" edc:desc="Lock Region 9" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_10" edc:desc="Lock Region 10" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_11" edc:desc="Lock Region 11" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_12" edc:desc="Lock Region 12" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_13" edc:desc="Lock Region 13" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_14" edc:desc="Lock Region 14" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_15" edc:desc="Lock Region 15" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_16" edc:desc="Lock Region 16" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_17" edc:desc="Lock Region 17" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_18" edc:desc="Lock Region 18" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_19" edc:desc="Lock Region 19" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_20" edc:desc="Lock Region 20" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_21" edc:desc="Lock Region 21" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_22" edc:desc="Lock Region 22" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_23" edc:desc="Lock Region 23" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_24" edc:desc="Lock Region 24" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_25" edc:desc="Lock Region 25" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_26" edc:desc="Lock Region 26" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_27" edc:desc="Lock Region 27" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_28" edc:desc="Lock Region 28" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_29" edc:desc="Lock Region 29" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_30" edc:desc="Lock Region 30" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_31" edc:desc="Lock Region 31" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1" edc:ppsfunction="default" ltx:memberofperipheral="PIOE"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOB9" edc:ppsfunction="B" ltx:memberofperipheral="TC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GTX0" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="C" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="DSR0" edc:ppsfunction="D" ltx:memberofperipheral="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA29" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RI1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TCLK2" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC21" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GRX1" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="DSR2" edc:ppsfunction="D" ltx:memberofperipheral="USART2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="MCDA0" edc:ppsfunction="C" ltx:memberofperipheral="HSMCI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GTX2" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="RXD2" edc:ppsfunction="B" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS1"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MLBCLK" edc:ppsfunction="C" ltx:memberofperipheral="MLB"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2" edc:ppsfunction="default" ltx:memberofperipheral="PIOE"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TCLK9" edc:ppsfunction="B" ltx:memberofperipheral="TC3"/>
    </edc:Pin>
