Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PC13" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GCOL" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="B" ltx:memberofperipheral="MCAN1"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC9" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOB7" edc:ppsfunction="B" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="B" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD14" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GRXCK" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO2" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="CANTX0" edc:ppsfunction="A" ltx:memberofperipheral="MCAN0"/>
      <edc:VirtualPin edc:name="CTS0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="NPCS0" edc:ppsfunction="D" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="CANRX0" edc:ppsfunction="A" ltx:memberofperipheral="MCAN0"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="RTS0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD27" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="B" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="TWD2" edc:ppsfunction="C" ltx:memberofperipheral="TWIHS2"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA26" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="DCD1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TIOA2" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="MCDA2" edc:ppsfunction="C" ltx:memberofperipheral="HSMCI"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="D" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="DTR1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="MCDA3" edc:ppsfunction="C" ltx:memberofperipheral="HSMCI"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC8" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="NWR0" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NWE" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NWR0" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NWE" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NWR0" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="NWE" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOA7" edc:ppsfunction="B" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE4" edc:ppsfunction="default" ltx:memberofperipheral="PIOE"/>
      <edc:VirtualPin edc:name="D12" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D12" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D12" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOB10" edc:ppsfunction="B" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="AD4" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RXD1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="PIODCEN2" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RK" edc:ppsfunction="A" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="NCS2" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NCS2" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NCS2" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="D15" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D15" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D15" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOB1" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOB6" edc:ppsfunction="B" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="CTS1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="MCCK" edc:ppsfunction="D" ltx:memberofperipheral="HSMCI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD20" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="B" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD28" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="URXD3" edc:ppsfunction="A" ltx:memberofperipheral="UART3"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="B" ltx:memberofperipheral="MCAN1"/>
      <edc:VirtualPin edc:name="TWCK2" edc:ppsfunction="C" ltx:memberofperipheral="TWIHS2"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD16" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GTX3" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="TXD2" edc:ppsfunction="B" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TWCK0" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS0"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C" ltx:memberofperipheral="UART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE5" edc:ppsfunction="default" ltx:memberofperipheral="PIOE"/>
      <edc:VirtualPin edc:name="D13" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D13" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D13" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TCLK10" edc:ppsfunction="B" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="D" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOA1" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C" ltx:memberofperipheral="UART2"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D" ltx:memberofperipheral="UART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="PCK" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TIOA6" edc:ppsfunction="B" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
