Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/edc/ATSAMV71Q19.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="UTXD0" edc:ppsfunction="A" ltx:memberofperipheral="UART0"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RD" edc:ppsfunction="C" ltx:memberofperipheral="SSC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GTXER" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="SCK2" edc:ppsfunction="B" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC28" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TCLK4" edc:ppsfunction="B" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="C" ltx:memberofperipheral="SPI1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD30" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="A" ltx:memberofperipheral="UART3"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="B" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7" edc:ppsfunction="default" ltx:memberofperipheral="PIOC"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="TCLK6" edc:ppsfunction="B" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="B" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C" ltx:memberofperipheral="UART2"/>
      <edc:VirtualPin edc:name="VSYNC" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="HSYNC" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD23" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="C" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="C" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="C" ltx:memberofperipheral="EBI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="SPCK" edc:ppsfunction="B" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD19" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="CTS2" edc:ppsfunction="B" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C" ltx:memberofperipheral="UART4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD18" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A" ltx:memberofperipheral="SDRAMC"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A" ltx:memberofperipheral="SMC"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A" ltx:memberofperipheral="EBI"/>
      <edc:VirtualPin edc:name="RTS2" edc:ppsfunction="B" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="URXD4" edc:ppsfunction="C" ltx:memberofperipheral="UART4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="B" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="URXD1" edc:ppsfunction="C" ltx:memberofperipheral="UART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="URXD0" edc:ppsfunction="A" ltx:memberofperipheral="UART0"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="B" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
